#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриОткрытииНаСервере()
	Номенклатура = Объект.Ссылка;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|ЦенаНоменклатурыСрезПоследних.Номенклатура,
		|	ЦенаНоменклатурыСрезПоследних.Цена
		|ИЗ
		|	РегистрСведений.ЦенаНоменклатуры.СрезПоследних КАК ЦенаНоменклатурыСрезПоследних
		|ГДЕ
		|	ЦенаНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Цена = ВыборкаДетальныеЗаписи.Цена;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
